input_openfoam/tutorials/combustion/reactingFoam/RAS/chockedNozzle/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          p;
}

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 250000;

boundaryField
{
    inletair
    {
        type            zeroGradient;
    }
    outlet
    {
        type            outletMachNumberPressure;
        pBack           101325;
        choked          true;
        relax           0.1;
        M               0.3;
        value           uniform 250000;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
